gsoap_use_wsdl/face.FaceDetectByBase64.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://tempuri.org/ns.xsd">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:FaceDetectByBase64>
   <img-base64></img-base64>
  </ns2:FaceDetectByBase64>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
